int/resources/objectRepo/xmlTemplates/opera/Housekeeping/req_FetchHousekeepingBoard.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/fof/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:FetchHousekeepingBoardRQ EchoToken="?" TimeStamp="?" Version="?" CorrelationID="?">
         <v91:OperaContext>
            <v91:UserLanguage></v91:UserLanguage>
            <v91:CROCode></v91:CROCode>
            <v91:HotelCode></v91:HotelCode>
            <v91:Language></v91:Language>
            <v91:RunningApplication></v91:RunningApplication>
            <v91:TerminalId></v91:TerminalId>
            <v91:LogLevel></v91:LogLevel>
            <v91:ExternalSystem></v91:ExternalSystem>
            <v91:Override></v91:Override>
            <v91:TargetExternalSystem></v91:TargetExternalSystem>
            <v91:UseLocal></v91:UseLocal>
            <v91:ExternalData></v91:ExternalData>
         </v91:OperaContext>
         <v9:Criteria PageNumber="?" MaxFetchCount="?">
            <v91:HotelCode></v91:HotelCode>
            <v91:RoomStatusFilter>
               <v91:HousekeepingRoomStatusList>
                  <v91:HousekeepingRoomStatus></v91:HousekeepingRoomStatus>
               </v91:HousekeepingRoomStatusList>
               <v91:FrontOfficeRoomStatusList>
                  <v91:FrontOfficeRoomStatus></v91:FrontOfficeRoomStatus>
               </v91:FrontOfficeRoomStatusList>
               <v91:HousekeepingTurndownStatusList>
                  <v91:TurndownStatus></v91:TurndownStatus>
               </v91:HousekeepingTurndownStatusList>
               <v91:RoomParityStatusList>
                  <v91:RoomParityStatus></v91:RoomParityStatus>
               </v91:RoomParityStatusList>
               <v91:ServiceRequestStatusList>
                  <v91:ServiceRequestStatus></v91:ServiceRequestStatus>
               </v91:ServiceRequestStatusList>
            </v91:RoomStatusFilter>
            <v91:RoomRange FromRoomNumber="?" ToRoomNumber="?"/>
            <v91:HousekeepingDateRange>
               <v91:StartDate></v91:StartDate>
               <v91:EndDate></v91:EndDate>
               <v91:Duration></v91:Duration>
            </v91:HousekeepingDateRange>
            <v91:FloorList>
               <v91:Floor></v91:Floor>
            </v91:FloorList>
            <v91:RoomTypeList>
               <v91:RoomType></v91:RoomType>
            </v91:RoomTypeList>
            <v91:RoomClassList>
               <v91:RoomClass></v91:RoomClass>
            </v91:RoomClassList>
            <v91:BuildingList>
               <v91:Building></v91:Building>
            </v91:BuildingList>
            <v91:RoomFeaturesList>
               <v91:RoomFeatures></v91:RoomFeatures>
            </v91:RoomFeaturesList>
            <v91:AMSectionList>
               <v91:AMSection></v91:AMSection>
            </v91:AMSectionList>
            <v91:PMSectionList>
               <v91:PMSection></v91:PMSection>
            </v91:PMSectionList>
            <v91:TaskCodeList>
               <v91:TaskCode></v91:TaskCode>
            </v91:TaskCodeList>
            <v91:ReservationStatusList>
               <v91:ReservationStatus></v91:ReservationStatus>
            </v91:ReservationStatusList>
            <v91:GuestServiceRequest></v91:GuestServiceRequest>
         </v9:Criteria>
      </v9:FetchHousekeepingBoardRQ>
   </soapenv:Body>
</soapenv:Envelope>
